// Replace placeholders with impacted users
let users = dynamic(["<user1@domain.com>", "<user2@domain.com>"]);
CloudAppEvents
| where AccountObjectId != ""
| where RawEventData has_any ("Exchange", "Inbox", "MailItemsAccessed", "MessageBind", "New-InboxRule")
| where AccountDisplayName in (users) or RawEventData has_any ("<user1@domain.com>", "<user2@domain.com>")
| project Timestamp, AccountDisplayName, ActionType, Application, IPAddress, RawEventData
| order by Timestamp desc
